app/views/orders/show.html.erb

<% for order in @orders %>
  Order no. <%= order.order_id %> for <%= order.customer %>
---
SELECT "orders".* FROM "orders"

    </tr>
    <% for order_line in order.order_lines %>
---
SELECT "order_lines".* FROM "order_lines"  WHERE "order_lines"."order_id" = ?  [["order_id", 1]]